#!/bin/bash

read -p "Введите путь к директории или команду: " CURRENTDIR
echo "Привет, $USER! Сегодняшняя дата: $(date +%d.%m.%Y)"

#содержит пробелы или символы ;, &, | это проверка
if [[ "$CURRENTDIR" == "cd .." ]] then
    echo "Вы ввели команду, выполняю..."
    cd ..  # Выполняем как команду
    echo "Переходим в директорию: $CURRENTDIR"
    echo "Рабочий каталог: $(pwd)"
    echo "Список файлов в текущей директории:"
    ls -l
else
    echo "Вы ввели путь к директории, выполняю..."
    cd "$CURRENTDIR"  # Выполняем как путь
    echo "Переходим в директорию: $CURRENTDIR"
    echo "Рабочий каталог: $(pwd)"
    echo "Список файлов в текущей директории:"
    ls -l


fi
